99cats/ninety_nine_cats/app/controllers/cat_rental_requests_controller.rb

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 2], ["start_date", "2018-11-13"], ["end_date", "2018-11-30"], ["created_at", "2018-11-14 01:02:08.735708"], ["updated_at", "2018-11-14 01:02:08.735708"]]
---
  def create
    request = CatRentalRequest.new(request_params)
    if request.save