99cats/ninety_nine_cats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["birth_date", "1996-11-07"], ["color", "calico"], ["name", "Nikki"], ["sex", "F"], ["created_at", "2018-11-13 21:35:24.255189"], ["updated_at", "2018-11-13 21:35:24.255189"]]
---
  def create
    cat = Cat.new(cat_params)
    if cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "Plz adopt me. MAPA MAPA"], ["updated_at", "2018-11-13 21:59:08.732010"], ["id", 4]]
---
  def update
    cat = Cat.find(params[:id])
    if cat.update(cat_params)