99cats/ninety_nine_cats/app/views/cats/_cat.html.erb

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 ORDER BY "cat_rental_requests"."start_date" ASC  [["cat_id", 6]]
---
Requests:
<% CatRentalRequest.where(cat_id: cat.id).order(start_date: :asc).each do |request| %>